app/controllers/squeezes_controller.rb

  def index
    # raise 'ok'
    if params[:id].nil?
      @user = current_user
      @last_squeezes = Squeeze.publish.recents.limit(30)
      # fresh_when(@last_squeezes)
    else
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 ORDER BY "users"."id" ASC LIMIT 1